dsgt-soap/requestaddorder.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://foodmenu.io/gt/webservice">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:addOrderRequest>
            <gs:name>Portobello</gs:name>
            <gs:quantity>2</gs:quantity>
        </gs:addOrderRequest>
    </soapenv:Body>
</soapenv:Envelope>
